{
  "main": {
    "name": "Deepanshu Goel",
    "occupation": "Full Stack Developer | UI/UX Designer",
    "description": "I am a Full Stack Developer and UI/UX Designer. I have a passion for web development and love to create web applications that are user-friendly and visually appealing. I am always looking for new opportunities to learn and grow as a developer.",
    "image": "profilepic.jpg",
    "bio": "As a highly motivated and passionate developer and designer, I am constantly driven by a thirst for knowledge and a keen interest in experimenting with new technologies. My extensive experience in building and publishing web applications using React.js has been instrumental in my professional growth.I pride myself on excellent communication skills, which have enabled me to collaborate effectively on various open-source projects and thrive in team environments. I firmly believe that collaboration is essential for both personal and professional development, as it pushes our potential and fosters continuous learning from others. Currently, I am delving into CI/CD workflows and blockchain contract building, two exciting technologies that are shaping the future of software development. Being part of this dynamic industry fuels my enthusiasm to learn and grow continuously. In summary, I am a dedicated and experienced developer with a strong desire to explore new technologies. My proven track record in React.js development, combined with my collaborative approach and communication skills, positions me well to contribute to innovative projects and advance in the ever-evolving tech landscape.",
    "email": "symaticvisuals02@gmail.com",
    "phone": "+91 8810421579",
    "address": {
      "city": "Delhi"
    },
    "website": "https://deepanshuweb.in/",
    "resumedownload": "https://drive.google.com/file/d/1jvuCF951epzwY7Xq85kfgEjIf6j0KefG/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/deepanshuweb/",
        "className": "fa fa-linkedin"
      },

      {
        "name": "github",
        "url": "https://github.com/symaticvisuals",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language Proficiency",
    "education": [
      {
        "school": "The Northcap University",
        "degree": "Bachelor's Degree, Computer Science",
        "graduated": "July 2023",
        "description": "Graduated with a Bachelor's Degree in Computer Science. I learned a lot about software development, algorithms, data structures, and web development."
      }
    ],
    "work": [
      {
        "company": "Mages Studio",
        "title": "Software Developer",
        "years": "Feb 2023 - Present",
        "description": "Enhanced CI/CD pipelines, reducing deployment times by 30% and improving workflow efficiency through automation with Docker adn Github Actions. Led the transformation of 4+ projects into customer-centric products, achieving a 25% increase in user satisfaction and engagement metrics. Spearheaded the upgrade and maintenance of key software products, ensuring 99.9% uptime and incorporating new features based on customer feedback."
      },
      {
        "company": "Pillup",
        "title": "Software Developer Intern",
        "years": "Jun 2022 - Dec 2022",
        "description": "Led the development of the Investor Dashboard and Prescriptionater projects, utilizing React.js and Node.js, and implemented RESTful APIs, enhancing system functionality and user interface. Ensured high code quality and reliability by implementing automated testing frameworks, resulting in a 40% reduction in bugs post-deployment."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "80%"
      },

      {
        "name": "Git",
        "level": "70%"
      },
      {
        "name": "JavaScript",
        "level": "80%"
      },
      {
        "name": "Typescript",
        "level": "50%"
      },
      {
        "name": "Web Development",
        "level": "95%"
      },
      {
        "name": "Java",
        "level": "45%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Git Riddle",
        "category": "AI, Web Development",
        "image": "snapchat.jpg",
        "url": "git-riddle.vercel.app"
      },
      {
        "title": "Artists World",
        "category": "Education",
        "image": "gmail.jpg",
        "url": "https://4artindia.vercel.app/"
      },
      {
        "title": "PID Projects",
        "category": "Interior Design",
        "image": "linkedin.jpg",
        "url": "https://www.pidprojects.in/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I Believe Logic builds inventions, & Design brings Intensions",
        "user": "Deepanshu Goel"
      }
    ]
  }
}
